In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [3]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [4]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [5]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data.drop('two', axis=1) # Specify with axis =1  ( columnwise selection)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [9]:
data.drop(['two', 'four'], axis = 1) #group of index, columns : with list.

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [10]:
obj = Series(np.arange(4. ), index = ['a', 'b', 'c', 'd'])

obj['b']

1.0

In [11]:
#Indexing, Selection, Filtering

obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b'], obj[1]

(1.0, 1.0)

In [12]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [13]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [14]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [15]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [16]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [17]:
obj['b':'c'] #ranging by Index Name

b    1.0
c    2.0
dtype: float64

In [17]:
obj[1:2]

b    1.0
dtype: float64

In [18]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [19]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [20]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [21]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [23]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [25]:
#Exceptional Cases. Selecting rows by slicing #:# , boolean array -> regarded as selecting rows
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [26]:
data[data['three'] > 5 ]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [28]:
data[data<5] = 0

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [32]:
data.ix[ ['Colorado', 'Utah'], [3,0,1] ]

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [35]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [41]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [36]:
data.ix[data.three >5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [37]:
data.ix[2] #select row

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [42]:
#selection by  slicing : maintain dataframe.
type(data[2:3])
#selection by ix(loc,iloc) : drop dataframe if possible(Series)
type(data.ix[2])

pandas.core.series.Series

In [43]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [44]:
#Arithmetic and Data Alignment
s1 = Series( np.random.uniform(-10,10,20), index = map(chr,np.random.randint(65, 91, 20)) )
s1

I    8.905693
C    3.162550
W    1.337851
G    9.477453
M   -1.083167
P    3.777625
K   -6.141606
R   -4.776509
H    1.945978
E   -6.337391
F    5.370006
C    1.440332
L    7.375875
V    6.352382
V    6.422588
F    4.366392
R    3.596671
E    7.890812
R    3.232797
N   -1.418568
dtype: float64

In [45]:
s2 = Series(np.random.uniform(-10,10,20), index = map(chr, np.random.randint(65,91, 20)) )
s2

H    3.859019
Y   -1.251623
N    5.387875
N   -4.793462
H   -4.427267
P    8.601701
A   -4.857341
K   -8.227036
Q    5.279836
V   -0.482262
N    0.802233
O    9.990304
D    3.757862
O   -7.136036
J    3.437474
X    3.678578
Y   -4.999071
L   -6.541475
X   -0.937726
J    8.894492
dtype: float64

In [42]:
s1 + s2

C         NaN
C         NaN
D         NaN
D         NaN
E    1.199098
E   -8.890071
F    5.507019
G         NaN
H         NaN
H         NaN
I         NaN
I         NaN
I         NaN
J         NaN
K         NaN
L         NaN
M         NaN
M         NaN
M         NaN
N         NaN
N         NaN
O         NaN
P         NaN
P         NaN
Q   -3.590677
R         NaN
S         NaN
T    6.294748
U         NaN
V    8.308500
W         NaN
X         NaN
X         NaN
Y         NaN
Y         NaN
dtype: float64

In [43]:
df1 = 

#help(np.random.uniform)
chr(48)
ord('A')

SyntaxError: invalid syntax (<ipython-input-43-0d6a6a0372bb>, line 1)

In [44]:
for i,j in enumerate(range(200)):
    print (i, chr(i)) # 65~90 65,91 / 97, 123

0  
1 
2 
3 
4 
5 
6 
7 
8 
9
10

11
12
13
14 
15 
16 
17 
18 
19 
20 
21 
22 
23 
24 
25 
26 
27 
28
29
30
31
32
33 !
34 "
35 #
36 $
37 %
38 &
39 '
40 (
41 )
42 *
43 +
44 ,
45 -
46 .
47 /
48 0
49 1
50 2
51 3
52 4
53 5
54 6
55 7
56 8
57 9
58 :
59 ;
60 <
61 =
62 >
63 ?
64 @
65 A
66 B
67 C
68 D
69 E
70 F
71 G
72 H
73 I
74 J
75 K
76 L
77 M
78 N
79 O
80 P
81 Q
82 R
83 S
84 T
85 U
86 V
87 W
88 X
89 Y
90 Z
91 [
92 \
93 ]
94 ^
95 _
96 `
97 a
98 b
99 c
100 d
101 e
102 f
103 g
104 h
105 i
106 j
107 k
108 l
109 m
110 n
111 o
112 p
113 q
114 r
115 s
116 t
117 u
118 v
119 w
120 x
121 y
122 z
123 {
124 |
125 }
126 ~
127 
128 
129 
130 
131 
132 
133
134 
135 
136 
137 
138 
139 
140 
141 
142 
143 
144 
145 
146 
147 
148 
149 
150 
151 
152 
153 
154 
155 
156 
157 
158 
159 
160
161 ¡
162 ¢
163 £
164 ¤
165 ¥
166 ¦
167 §
168 ¨
169 ©
170 ª
171 «
172 ¬
173 ­
174 ®
175 ¯
176 °
177 ±
178 ²
179 ³
180 ´
181 µ
182 ¶
183 ·
184 ¸
185 ¹
186 º
187 »
188 ¼
189 ½
190 ¾
191 ¿
192 À
193 Á
194 Â
195 Ã
196 Ä
197 Å
198 Æ
199 Ç

In [45]:
np.random.uniform(-10,10,5)

array([ 7.31039302,  9.66178505,  4.82433959, -3.16801109, -4.90795003])

In [46]:
list(map(chr,np.random.randint(65, 91, 5)))

['C', 'L', 'A', 'O', 'N']

In [46]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [48]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [49]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [48]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [49]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [50]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [51]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [52]:
df1.add(df2, fill_value= 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [53]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [54]:
df1.reindex(index = df2.index, columns=df2.columns, fill_value=0)

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [55]:
arr = np.arange(12.).reshape((3,4))

In [56]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [57]:
arr[0]
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [74]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [64]:
frame = frame.ix[0]
frame

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [65]:
frame.ix[0]

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

0.0

In [61]:
series = frame.iloc[0]

In [67]:
frame - series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [75]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
series2 = Series(range(3), index = ['b','e', 'f'])
frame + series2 #rowwise broadcast column matching.

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [76]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [77]:
frame.sub(series3, axis = 0) #columnwise #axis 0 is set for prefering for data integrity

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [81]:
frame.sub(series3)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [82]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),index=['Utah','Ohio', 'Texas','Oregon'])

In [83]:
frame

               b         d         e
Utah    0.238503  2.185519 -0.598075
Ohio    1.335667  0.519950 -1.014710
Texas  -0.978761 -0.720257 -0.849996
Oregon -1.433306  0.763306  0.038548

In [84]:
np.abs(frame)

               b         d         e
Utah    0.238503  2.185519  0.598075
Ohio    1.335667  0.519950  1.014710
Texas   0.978761  0.720257  0.849996
Oregon  1.433306  0.763306  0.038548

In [89]:
f = lambda x: x.max() - x.min()
frame.apply(f) #ColumnWise apply, axis = 0
#return series with each row mapping one resultant value from f <- column

b    2.768974
d    2.905775
e    1.053258
dtype: float64

In [86]:
frame.apply(f, axis = 1) #RowWise apply, axis = 1

Utah      2.783594
Ohio      2.350377
Texas     0.258504
Oregon    2.196613
dtype: float64

In [90]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

frame.apply(f)

            b         d         e
min -1.433306 -0.720257 -1.014710
max  1.335667  2.185519  0.038548

In [88]:
format = lambda x: '%.2f' % x

In [98]:
frame.applymap(format)

            b      d      e
Utah    -2.28   0.74  -0.53
Ohio    -0.20  -0.06  -0.89
Texas    0.14   0.52   0.82
Oregon  -0.62  -0.11  -0.02

In [107]:
f = lambda x: x.max() - x.min()
print (frame.apply(f))
print (frame.apply(f, axis = 1))

b    2.423587
d    0.856324
e    1.709792
dtype: float64
Utah      3.024735
Ohio      0.836865
Texas     0.675196
Oregon    0.598944
dtype: float64

In [105]:
format = lambda x: '%.2f' % x

In [106]:
#applymap confuct elementwise operation
frame.applymap(format)

            b      d      e
Utah    -2.28   0.74  -0.53
Ohio    -0.20  -0.06  -0.89
Texas    0.14   0.52   0.82
Oregon  -0.62  -0.11  -0.02

In [109]:
#map conduct elementwise operation on series
frame['e'].map(format)

Utah      -0.53
Ohio      -0.89
Texas      0.82
Oregon    -0.02
Name: e, dtype: object

In [110]:
#Sorting and Ranking

obj = Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [95]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [97]:
print (frame.sort_index(axis = 0)) #columndirection by row-values

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [98]:
print (frame.sort_index(axis = 1)) #row direction by column-values(different data type)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [99]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [100]:
obj = Series(np.random.randint(-10,10,5))
obj

0   -2
1   -1
2    9
3    0
4    9
dtype: int64

In [101]:
#order() method not supported anymore.?
obj.sort_values() #index sync

0   -2
1   -1
3    0
2    9
4    9
dtype: int64

In [119]:
#Missing Values come at last
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [121]:
frame = DataFrame({'b': [4, -7, -3,2], 'a': [0,1,0,1]})
frame

   a  b
0  0  4
1  1 -7
2  0 -3
3  1  2

In [104]:
frame.sort_index(by = 'b')

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [105]:
frame.sort_index(axis = 0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [106]:
frame.sort_values(by = 'b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [107]:
frame.sort_index(by = ['a', 'b'])

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [108]:
frame.sort_values(by =['a', 'b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [113]:
print (frame)
frame.sort_values(axis = 1, by = 'three')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [114]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
print (obj)
obj.rank()

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [116]:
obj.rank(method = 'first') # Give Priority to preceeding elements for same value

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [117]:
print (obj)
print (obj.rank(ascending = False, method = 'max'))
print (obj.rank(ascending = True, method = 'min'))

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64
0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64
0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [137]:
obj.rank(ascending = False, method = 'min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [141]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [142]:
obj.rank(ascending = False, method = 'first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [146]:
frame = DataFrame({'b' : [4.3, 7, -3, 2], 'a': [0,1,0,1], 'c' : [-2, 5, 8, -2.5]})

frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [147]:
frame.rank(axis = 1) # Along the row direction

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [148]:
frame.rank(axis = 0) #Along column direction

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [150]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [152]:
obj.index.is_unique

False

In [153]:
#Series selection
obj['a']

a    0
a    1
dtype: int64

In [154]:
obj['c']

4

In [118]:
df = DataFrame(np.random.randn(4,3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.090022 -1.876997  1.690142
a -1.311345 -0.948264 -1.075813
b -0.798469 -0.535152 -0.156950
b -0.209923  0.450426 -0.952799

In [119]:
df.loc['b']

          0         1         2
b -0.798469 -0.535152 -0.156950
b -0.209923  0.450426 -0.952799

In [120]:
#Summarizing and Computing Descriptive Statistics

df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
               index =['a', 'b', 'c', 'd'], columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [121]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [122]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [123]:
df.mean(axis = 1, skipna = False) #return NAN if nan exist

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [125]:
df.mean(axis = 1) #Nan is omitted at the count.

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [128]:
print (df)
df.idxmax() #columnwise indexnumber with maximum value

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    b
two    d
dtype: object

In [132]:
print (df.cumsum())
print (df.cumsum(axis = 1)) #RowWise direction

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8
    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [133]:
df_summ = df.describe() #  columnwise
df_summ

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [134]:
df.T.describe()

         a         b    c         d
count  1.0  2.000000  0.0  2.000000
mean   1.4  1.300000  NaN -0.275000
std    NaN  8.202439  NaN  1.449569
min    1.4 -4.500000  NaN -1.300000
25%    1.4 -1.600000  NaN -0.787500
50%    1.4  1.300000  NaN -0.275000
75%    1.4  4.200000  NaN  0.237500
max    1.4  7.100000  NaN  0.750000

In [135]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [136]:
print (frame)
frame.count() # axis = 1

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

d    2
a    2
b    2
c    2
dtype: int64

In [137]:
frame.min()

d    0
a    1
b    2
c    3
dtype: int64

In [138]:
frame.max()

d    4
a    5
b    6
c    7
dtype: int64

In [139]:
frame.idxmin()

d    three
a    three
b    three
c    three
dtype: object

In [140]:
frame.idxmax()

d    one
a    one
b    one
c    one
dtype: object

In [141]:
frame.quantile()

d    2.0
a    3.0
b    4.0
c    5.0
Name: 0.5, dtype: float64

In [191]:
frame.sum()

a     2.0
b    10.3
c     8.5
dtype: float64

In [192]:
frame.mean()

a    0.500
b    2.575
c    2.125
dtype: float64

In [142]:
frame.median()

d    2.0
a    3.0
b    4.0
c    5.0
dtype: float64

In [144]:
frame.mad() #mean absolute deviation from mean value

d    2.0
a    2.0
b    2.0
c    2.0
dtype: float64

In [145]:
frame.var() #2nd moment

d    8.0
a    8.0
b    8.0
c    8.0
dtype: float64

In [146]:
frame.std() #

d    2.828427
a    2.828427
b    2.828427
c    2.828427
dtype: float64

In [147]:
frame.skew() #3rd moment

d   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [148]:
frame.kurt() # 4th moment

d   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [149]:
frame.cumsum()

       d  a  b   c
three  0  1  2   3
one    4  6  8  10

In [157]:
df = DataFrame(np.arange(16).reshape(4,4), index = np.arange(4), columns=['a','b','c','d'])
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [158]:
print (df.cummin())

   a  b  c  d
0  0  1  2  3
1  0  1  2  3
2  0  1  2  3
3  0  1  2  3

In [159]:
print (df.cummax())

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [160]:
df.cumprod()

   a    b     c     d
0  0    1     2     3
1  0    5    12    21
2  0   45   120   231
3  0  585  1680  3465

In [161]:
df.diff()

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  4.0  4.0  4.0  4.0
2  4.0  4.0  4.0  4.0
3  4.0  4.0  4.0  4.0

In [162]:
df.pct_change() #change in percent

          a         b         c         d
0       NaN       NaN       NaN       NaN
1       inf  4.000000  2.000000  1.333333
2  1.000000  0.800000  0.666667  0.571429
3  0.500000  0.444444  0.400000  0.363636

In [1]:
import pandas_datareader as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT','GOOG']:
    #Yahoo No longer support Finance API
    all_data[ticker] = web.get_data_google(ticker)

In [175]:
data_AAPL = all_data['AAPL']

print (data_AAPL.columns)
data_AAPL.index

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
               '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
               '2010-01-14', '2010-01-15',
               ...
               '2017-06-20', '2017-06-21', '2017-06-22', '2017-06-23',
               '2017-06-26', '2017-06-27', '2017-06-28', '2017-06-29',
               '2017-06-30', '2017-07-03'],
              dtype='datetime64[ns]', name='Date', length=1887, freq=None)

In [176]:
price = DataFrame({tic: data['Close'] for tic, data in all_data.items()})

In [177]:
volume = DataFrame({ tic: data['Volume'] for tic, data in all_data.items() })

In [179]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001963 -0.004408 -0.012080  0.000323
2010-01-06 -0.015997 -0.025186 -0.006496 -0.006137
2010-01-07 -0.001991 -0.023303 -0.003462 -0.010400
2010-01-08  0.006649  0.013345  0.010035  0.006897
2010-01-11 -0.008587 -0.001530 -0.010470 -0.012720
2010-01-12 -0.011659 -0.017685  0.007955 -0.006607
2010-01-13  0.014156 -0.005730 -0.002145  0.009312
2010-01-14 -0.005650  0.004706  0.015972  0.020099
2010-01-15 -0.016711 -0.016699 -0.004006 -0.003230
2010-01-19  0.044188  0.013151  0.017909  0.007777
2010-01-20 -0.015299 -0.012299 -0.029000 -0.016720
2010-01-21 -0.017521  0.004450 -0.009597 -0.018640
2010-01-22 -0.049462 -0.056559 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004486 -0.002934  0.006139
2010-01-27  0.009517 -0.000591  0.004612  0.005763
2010-01-28 -0.041414 -0.014403 -0.020423 -0.017189
2010-01-29 -0.036178 -0.008131 -0.010990 -0.033608
2010-02-01  0.013848  0.005780  0.018629  0.008162
2010-02-02  0.005751 -0.003568  0.006898  0.001760
2010-02-03  0.017155  0.018282  0.001036  0.005973
2010-02-04 -0.035840 -0.025950 -0.021168 -0.027593
2010-02-05  0.017493  0.008551  0.004228  0.006466
2010-02-08 -0.006805  0.004107 -0.013277 -0.010707
2010-02-09  0.010819  0.005554  0.010912  0.010462
2010-02-10 -0.005708 -0.003695 -0.003246 -0.000714
2010-02-11  0.018299  0.003634  0.007491  0.004645
2010-02-12  0.008809 -0.006121  0.002182 -0.006757
2010-02-16  0.015019  0.015359  0.009919  0.015038
...              ...       ...       ...       ...
2017-05-22  0.006076  0.008405  0.004343  0.011228
2017-05-23 -0.001234  0.007390 -0.003996  0.003360
2017-05-24 -0.002991  0.006471  0.003157  0.001310
2017-05-25  0.003456  0.015268  0.004524  0.012360
2017-05-26 -0.001690  0.001991 -0.004634  0.004884
2017-05-30  0.000391  0.004540 -0.004984  0.006432
2017-05-31 -0.005922 -0.011292  0.005932 -0.008095
2017-06-01  0.002749  0.002166  0.000262  0.003723
2017-06-02  0.014819  0.008946 -0.004061  0.023680
2017-06-05 -0.009778  0.008282  0.002368  0.007246
2017-06-06  0.003378 -0.007228 -0.000262  0.003320
2017-06-07  0.005957  0.004618 -0.009123 -0.001793
2017-06-08 -0.002446  0.002375  0.007418 -0.006078
2017-06-09 -0.038777 -0.034146  0.013149 -0.022655
2017-06-12 -0.023896 -0.007296  0.007008 -0.007679
2017-06-13  0.008046  0.011136 -0.005993  0.012468
2017-06-14 -0.009755 -0.002769 -0.002853 -0.005379
2017-06-15 -0.005993 -0.008888  0.002666 -0.005265
2017-06-16 -0.014000 -0.002685  0.007522  0.001431
2017-06-19  0.028608  0.018717 -0.003475  0.012429
2017-06-20 -0.009088 -0.007040  0.000710 -0.013546
2017-06-21  0.005931  0.009278 -0.007486  0.005149
2017-06-22 -0.001645 -0.002460  0.003966 -0.000142
2017-06-23  0.004463  0.008881 -0.001878  0.013521
2017-06-26 -0.003145 -0.013795  0.007268 -0.009549
2017-06-27 -0.014333 -0.026190 -0.003092 -0.018715
2017-06-28  0.014611  0.014191  0.003683  0.008525
2017-06-29 -0.014743 -0.024136 -0.007662 -0.018768
2017-06-30  0.002366 -0.009872 -0.001946  0.006424
2017-07-03 -0.003611 -0.011037  0.011376 -0.011026

[1888 rows x 4 columns]

In [275]:
returns.mul(100).applymap( (lambda x : '%4.2f' % x) )

             AAPL   GOOG    IBM   MSFT
Date
2010-01-04    nan    nan    nan    nan
2010-01-05   0.20  -0.44  -1.21   0.03
2010-01-06  -1.60  -2.52  -0.65  -0.61
2010-01-07  -0.20  -2.33  -0.35  -1.04
2010-01-08   0.66   1.33   1.00   0.69
2010-01-11  -0.86  -0.15  -1.05  -1.27
2010-01-12  -1.17  -1.77   0.80  -0.66
2010-01-13   1.42  -0.57  -0.21   0.93
2010-01-14  -0.56   0.47   1.60   2.01
2010-01-15  -1.67  -1.67  -0.40  -0.32
2010-01-19   4.42   1.32   1.79   0.78
2010-01-20  -1.53  -1.23  -2.90  -1.67
2010-01-21  -1.75   0.44  -0.96  -1.86
2010-01-22  -4.95  -5.66  -2.71  -3.50
2010-01-25   2.69  -1.82   0.49   1.24
2010-01-26   1.41   0.45  -0.29   0.61
2010-01-27   0.95  -0.06   0.46   0.58
2010-01-28  -4.14  -1.44  -2.04  -1.72
2010-01-29  -3.62  -0.81  -1.10  -3.36
2010-02-01   1.38   0.58   1.86   0.82
2010-02-02   0.58  -0.36   0.69   0.18
2010-02-03   1.72   1.83   0.10   0.60
2010-02-04  -3.58  -2.59  -2.12  -2.76
2010-02-05   1.75   0.86   0.42   0.65
2010-02-08  -0.68   0.41  -1.33  -1.07
2010-02-09   1.08   0.56   1.09   1.05
2010-02-10  -0.57  -0.37  -0.32  -0.07
2010-02-11   1.83   0.36   0.75   0.46
2010-02-12   0.88  -0.61   0.22  -0.68
2010-02-16   1.50   1.54   0.99   1.50
...           ...    ...    ...    ...
2017-05-09   0.64  -0.23  -0.60   0.15
2017-05-10  -0.47  -0.36  -0.57   0.39
2017-05-11   0.45   0.20  -0.40  -1.23
2017-05-12   1.40   0.17  -0.19  -0.12
2017-05-15  -0.26   0.52   0.76   0.07
2017-05-16  -0.15   0.63   1.43   1.43
2017-05-17  -3.36  -2.48  -1.79  -2.78
2017-05-18   1.52   1.15  -0.10   0.34
2017-05-19   0.34   0.41   0.80  -0.03
2017-05-22   0.61   0.84   0.43   1.12
2017-05-23  -0.12   0.74  -0.40   0.34
2017-05-24  -0.30   0.65   0.32   0.13
2017-05-25   0.35   1.53   0.45   1.24
2017-05-26  -0.17   0.20  -0.46   0.49
2017-05-30   0.04   0.45  -0.50   0.64
2017-05-31  -0.59  -1.13   0.59  -0.81
2017-06-01   0.27   0.22   0.03   0.37
2017-06-02   1.48   0.89  -0.41   2.37
2017-06-05  -0.98   0.83   0.24   0.72
2017-06-06   0.34  -0.72  -0.03   0.33
2017-06-07   0.60   0.46  -0.91  -0.18
2017-06-08  -0.24   0.24   0.74  -0.61
2017-06-09  -3.88  -3.41   1.31  -2.27
2017-06-12  -2.39  -0.73   0.70  -0.77
2017-06-13   0.80   1.11  -0.60   1.25
2017-06-14  -0.98  -0.28  -0.29  -0.54
2017-06-15  -0.60  -0.89   0.27  -0.53
2017-06-16  -1.40  -0.27   0.75   0.14
2017-06-19   2.86   1.87  -0.35   1.24
2017-06-20  -0.91  -0.70   0.07  -1.35

[1879 rows x 4 columns]

In [182]:
print (returns.MSFT.corr(returns.IBM))

print (returns.AAPL.corr(returns.GOOG))

0.487018905868
0.413766338355

In [279]:
Series([-1,1,-1,1]).corr(Series([-1,1,-1,1]))

1.0

In [283]:
Series([-1,1,-1,1]).corr(Series([-1,0,-1,1]))

0.90453403373329089

In [183]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.413766  0.372668  0.390429
GOOG  0.413766  1.000000  0.394508  0.474519
IBM   0.372668  0.394508  1.000000  0.487019
MSFT  0.390429  0.474519  0.487019  1.000000

In [184]:
returns.var()

AAPL    0.000263
GOOG    0.000238
IBM     0.000141
MSFT    0.000204
dtype: float64

In [285]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000263  0.000103  0.000072  0.000090
GOOG  0.000103  0.000238  0.000073  0.000104
IBM   0.000072  0.000073  0.000142  0.000083
MSFT  0.000090  0.000104  0.000083  0.000204

In [192]:
returns.corrwith(returns.IBM) #correlation with IBM

AAPL    0.372668
GOOG    0.394508
IBM     1.000000
MSFT    0.487019
dtype: float64

In [197]:
returns.corrwith(volume) #correlaton between returns and volume.

AAPL   -0.070580
GOOG    0.032878
IBM    -0.207850
MSFT   -0.089288
dtype: float64

In [293]:
volume

                   AAPL       GOOG       IBM         MSFT
Date
2010-01-04  123432050.0        NaN   6155846   38414185.0
2010-01-05  150476004.0        NaN   6842471   49758862.0
2010-01-06  138039594.0        NaN   5605290   58182332.0
2010-01-07  119282324.0        NaN   5840569   50564285.0
2010-01-08  111969081.0        NaN   4197105   51201289.0
2010-01-11  115557365.0        NaN   5731177   68754648.0
2010-01-12  148614774.0        NaN   8083354   65913228.0
2010-01-13  151472335.0        NaN   6458302   51863463.0
2010-01-14  108288411.0        NaN   7114544   63244767.0
2010-01-15  148584065.0        NaN   8502320   79915648.0
2010-01-19  182501620.0        NaN  13916168   46582886.0
2010-01-20  153037892.0        NaN  15201857   54857712.0
2010-01-21  152038565.0        NaN   9608696   73086701.0
2010-01-22  220441872.0        NaN  10089325  102004573.0
2010-01-25  266424802.0        NaN   5738920   63381173.0
2010-01-26  466777486.0        NaN   7136640   66647676.0
2010-01-27  430642030.0        NaN   8719447   63949492.0
2010-01-28  293375376.0        NaN   9622829  117513692.0
2010-01-29  311487785.0        NaN  11572387  193888424.0
2010-02-01  187468421.0        NaN   7249873   85931099.0
2010-02-02  174585313.0        NaN   5900187   54413654.0
2010-02-03  153831769.0        NaN   4177981   61397848.0
2010-02-04  189412762.0        NaN   9129991   77849968.0
2010-02-05  212576350.0        NaN   8618019   80960063.0
2010-02-08  119567119.0        NaN   5719389   52826474.0
2010-02-09  158221028.0        NaN   6044966   59195742.0
2010-02-10   92590218.0        NaN   5219260   48591246.0
2010-02-11  137585903.0        NaN   5091096   65995913.0
2010-02-12  163866906.0        NaN   8018236   81121515.0
2010-02-16  135987761.0        NaN   6777265   51938098.0
...                 ...        ...       ...          ...
2017-05-09   39130363.0  1581809.0   6853043   22858414.0
2017-05-10   25805692.0  1173925.0   4999861   17977830.0
2017-05-11   27255058.0   835386.0   5627964   28789413.0
2017-05-12   32527017.0  1050601.0   3715702   18714123.0
2017-05-15   26009719.0  1108496.0   4245471   31530301.0
2017-05-16   20048478.0   969479.0   5513690   34956038.0
2017-05-17   50767678.0  2362072.0   5191494   30548781.0
2017-05-18   33568215.0  1596897.0   3274371   25201274.0
2017-05-19   26960788.0  1393024.0   5643264   26961119.0
2017-05-22   22966437.0  1120385.0   3302539   16237550.0
2017-05-23   19918871.0  1270817.0   2564503   15425824.0
2017-05-24   19219154.0  1034199.0   3732399   14666865.0
2017-05-25   19235598.0  1660474.0   2582815   21854095.0
2017-05-26   21927637.0  1252010.0   2443507   19827923.0
2017-05-30   20126851.0  1466654.0   3666032   17072838.0
2017-05-31   24451164.0  2448067.0   3543404   30436364.0
2017-06-01   16404088.0  1410458.0   2918126   21603601.0
2017-06-02   27770715.0  1750955.0   3585701   34770261.0
2017-06-05   25331662.0  1252106.0   3975268   33316760.0
2017-06-06   26624926.0  1814624.0   3797173   31511065.0
2017-06-07   21069647.0  1453874.0   4865712   22301765.0
2017-06-08   21250798.0  1481916.0   3708962   24588270.0
2017-06-09   64882657.0  3309389.0   4361460   49187396.0
2017-06-12   72307330.0  3763529.0   6471479   47761743.0
2017-06-13   34165445.0  2013337.0   3523529   25258614.0
2017-06-14   31531232.0  1489715.0   3049726   25510685.0
2017-06-15   32165373.0  2133050.0   4654297   26068709.0
2017-06-16   50361093.0  3094711.0   6741963   48345085.0
2017-06-19   32541404.0  1533336.0   4629592   23798268.0
2017-06-20   24900073.0  1125990.0   4481843   21512231.0

[1879 rows x 4 columns]

In [198]:
obj = Series(['c', 'a', 'd', 'a', 'b', 'b', 'c', 'c'])

uniques = obj.unique()

In [199]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [202]:
obj.value_counts(sort= True) # count values of each unique element.

c    3
a    2
b    2
d    1
dtype: int64

In [203]:
pd.value_counts(obj.values, sort = False)
obj.value_counts(sort=False)

c    3
b    2
d    1
a    2
dtype: int64

In [204]:
mask = obj.isin(['b', 'c']) #Membership test and filtering
mask

0     True
1    False
2    False
3    False
4     True
5     True
6     True
7     True
dtype: bool

In [205]:
obj[mask]

0    c
4    b
5    b
6    c
7    c
dtype: object

In [206]:
data = DataFrame({'Qu1' : [1,3,4,3,4], 'Qu2':[2,3,1,2,3] , 'Qu3': [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [209]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [210]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [211]:
string_data.isnull() #Null test. np.nan matching

0    False
1    False
2     True
3    False
dtype: bool

In [212]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [213]:
#dropna, fillna(ffill, bfill), isnull, notnull

from numpy import nan as NA

data = Series([1, NA, 3.5, NA, 7])
data.dropna() #= data[data.notnull()] drop in the unit as row.

0    1.0
2    3.5
4    7.0
dtype: float64

In [218]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA],[NA, 6.5, 3.]])
cleaned = data.dropna() #Data Integrity 무결성 데이터만 선택 (Rowwise)
cleaned

     0    1    2
0  1.0  6.5  3.0

In [219]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [220]:
data.dropna(how = 'all') # 모두 없는 경우만 제외

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [221]:
data[4] = NA
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [222]:
df = DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA; df.iloc[:2,2] = NA
df

          0         1         2
0  0.087826       NaN       NaN
1 -1.762683       NaN       NaN
2  1.250791       NaN -0.540920
3 -0.229674       NaN -1.735420
4 -0.589481  0.714849  0.402837
5  2.243794 -0.553175 -1.272159
6  0.159720  0.263209  0.821498

In [225]:
df.dropna(thresh = 2) #thresh 보다 같거나 많으면 drop

          0         1         2
2  1.250791       NaN -0.540920
3 -0.229674       NaN -1.735420
4 -0.589481  0.714849  0.402837
5  2.243794 -0.553175 -1.272159
6  0.159720  0.263209  0.821498

In [226]:
df.fillna(0)

          0         1         2
0  0.087826  0.000000  0.000000
1 -1.762683  0.000000  0.000000
2  1.250791  0.000000 -0.540920
3 -0.229674  0.000000 -1.735420
4 -0.589481  0.714849  0.402837
5  2.243794 -0.553175 -1.272159
6  0.159720  0.263209  0.821498

In [227]:
df.fillna({1:0.5, 3:-1}) #columnwise fill value assignment

          0         1         2
0  0.087826  0.500000       NaN
1 -1.762683  0.500000       NaN
2  1.250791  0.500000 -0.540920
3 -0.229674  0.500000 -1.735420
4 -0.589481  0.714849  0.402837
5  2.243794 -0.553175 -1.272159
6  0.159720  0.263209  0.821498

In [228]:
#modify existing object
# inplace = True
_ = df.fillna(0, inplace=True) #modify calling object.without copy
df

          0         1         2
0  0.087826  0.000000  0.000000
1 -1.762683  0.000000  0.000000
2  1.250791  0.000000 -0.540920
3 -0.229674  0.000000 -1.735420
4 -0.589481  0.714849  0.402837
5  2.243794 -0.553175 -1.272159
6  0.159720  0.263209  0.821498

In [230]:
df = DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA; df.iloc[4:, 2] = NA
df

          0         1         2
0  0.960052 -1.591673  1.716238
1  0.708073  0.707921  0.333934
2 -1.258585       NaN  0.417544
3 -0.036482       NaN -0.973794
4 -0.891204       NaN       NaN
5  0.479075       NaN       NaN

In [231]:
df.fillna(method = 'ffill')

          0         1         2
0  0.960052 -1.591673  1.716238
1  0.708073  0.707921  0.333934
2 -1.258585  0.707921  0.417544
3 -0.036482  0.707921 -0.973794
4 -0.891204  0.707921 -0.973794
5  0.479075  0.707921 -0.973794

In [233]:
df.fillna(method = 'ffill', limit=3) #maximum number of filling iterations
# limit = 3, fill in 3times maximally

          0         1         2
0  0.960052 -1.591673  1.716238
1  0.708073  0.707921  0.333934
2 -1.258585  0.707921  0.417544
3 -0.036482  0.707921 -0.973794
4 -0.891204  0.707921 -0.973794
5  0.479075       NaN -0.973794

In [234]:
data = Series(np.random.randn(10),
              index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.362906
   2    0.422781
   3   -0.198805
b  1    0.647243
   2   -0.844150
   3    0.892033
c  1    0.461763
   2   -0.671120
d  2   -1.219499
   3    0.323561
dtype: float64

In [235]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [236]:
data['b']

1    0.647243
2   -0.844150
3    0.892033
dtype: float64

In [238]:
data['b':'c']

b  1    0.647243
   2   -0.844150
   3    0.892033
c  1    0.461763
   2   -0.671120
dtype: float64

In [240]:
data.loc[['b','c']]

b  1    0.647243
   2   -0.844150
   3    0.892033
c  1    0.461763
   2   -0.671120
dtype: float64

In [241]:
data[:,2]

a    0.422781
b   -0.844150
c   -0.671120
d   -1.219499
dtype: float64

In [242]:
data.unstack() #tablize the multi-indexed Serial Data

          1         2         3
a -0.362906  0.422781 -0.198805
b  0.647243 -0.844150  0.892033
c  0.461763 -0.671120       NaN
d       NaN -1.219499  0.323561

In [244]:
data.unstack().stack()

a  1   -0.362906
   2    0.422781
   3   -0.198805
b  1    0.647243
   2   -0.844150
   3    0.892033
c  1    0.461763
   2   -0.671120
d  2   -1.219499
   3    0.323561
dtype: float64

In [246]:
data = DataFrame(np.arange(16).reshape(4,4))

In [250]:
data_ser = data.unstack()

In [251]:
data_ser.index

MultiIndex(levels=[[0, 1, 2, 3], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3], [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]])

In [252]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns = [['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [254]:
frame.index.names = ['key1','key2'] # multi-index
frame.columns.names = ['state', 'color'] # multi-columns
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [255]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [256]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']],
                         names = ['state', 'color'])

frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [258]:
frame.swaplevel('key1', 'key2').swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [262]:
frame.swaplevel(axis = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [263]:
frame.sortlevel(1)

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [267]:
frame.swaplevel().sortlevel(1)

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [269]:
frame.swaplevel(0,1).sortlevel(0)

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [270]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [274]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [271]:
frame.sum(level = 'color', axis = 1) # 'color' is in the column index

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [275]:
frame.sum(level='color', axis = 0) #error, 'color is not in the index

AssertionError: Level color not in index

In [277]:
frame = DataFrame({'a': range(7), 'b' : range(7,0,-1),
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd': [0,1,2,0,1,2,3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [278]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [282]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [285]:
frame2.index.names
frame2.index

MultiIndex(levels=[['one', 'two'], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 0, 1, 2, 3]],
           names=['c', 'd'])

In [291]:
frame2.swaplevel('c','d')

       a  b
d c
0 one  0  7
1 one  1  6
2 one  2  5
0 two  3  4
1 two  4  3
2 two  5  2
3 two  6  1

In [292]:
frame2.swaplevel('c','d').sortlevel()

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

       a  b
d c
0 one  0  7
  two  3  4
1 one  1  6
  two  4  3
2 one  2  5
  two  5  2
3 two  6  1

In [293]:
frame2.swaplevel('c','d').sort_index(level = 0)

       a  b
d c
0 one  0  7
  two  3  4
1 one  1  6
  two  4  3
2 one  2  5
  two  5  2
3 two  6  1

In [294]:
frame.set_index(['c', 'd'], drop=False) # Crit columns are not removed.

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [295]:
frame2.reset_index() # bring indexes into the columndata and reindex with ordinal numbers

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [296]:
ser = Series(np.arange(3.))
ser[-1]

KeyError: -1

In [298]:
#Ambiguity arise when index is labeled with integers,
ser.index #indexingwill be label oriented., '-1' does not exist.

RangeIndex(start=0, stop=3, step=1)

In [310]:
ser_int = Series(np.arange(3.))
ser_chr = Series(np.arange(3.), index = ['a', 'b', 'c'])

try:
    print (ser_int[-1])
    
except Exception as ex:
    print (ex.args)
    
try:
    print (ser_chr[-1])
    
except Exception as ex:
    print ( ex.args)

(-1,)
2.0

In [300]:
ser.iloc[:1]

0    0.0
dtype: float64

In [301]:
ser3 = Series(range(3), index = [-5,1,3])

In [304]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [319]:
ser_int

0    0.0
1    1.0
2    2.0
dtype: float64

In [320]:
print (ser_int.loc[:1]) #label oriented

print (ser_int.iloc[:1]) # i loc oriented

0    0.0
1    1.0
dtype: float64
0    0.0
dtype: float64

In [325]:
ser3 = Series(range(3), index = [-5, 1, 3])
ser3.iloc[2] #iloc<- iget_value

2

In [322]:
frame = DataFrame(np.arange(6).reshape(3,2), index = [2,0,1])
frame.irow(0)

AttributeError: 'DataFrame' object has no attribute 'irow'

In [327]:
frame = DataFrame(np.arange(6).reshape(3,2), index = [2,0,1])
frame.iloc[0] ##<- irow, icol

0    0
1    1
Name: 2, dtype: int64

In [ ]:
dict((idx, i) for idx, i in enumerate(range(5)))

In [334]:
#Panel Data
pdata = pd.Panel(dict((stk, web.get_data_google(stk)) for stk in 
                     ['AAPL', 'GOOG', 'MSFT', 'DELL']))

pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1887 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-07-03 00:00:00
Minor_axis axis: Open to Volume

In [340]:
'''
<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1887 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-07-03 00:00:00
Minor_axis axis: Open to Volume
'''

#4 items : 종목별

"\n<class 'pandas.core.panel.Panel'>\nDimensions: 4 (items) x 1887 (major_axis) x 5 (minor_axis)\nItems axis: AAPL to MSFT\nMajor_axis axis: 2010-01-04 00:00:00 to 2017-07-03 00:00:00\nMinor_axis axis: Open to Volume\n"

In [343]:
pdata_byattr = pdata.swapaxes('items', 'minor')
#pdata_byattr = pdata.to_xarray()

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

In [346]:
pdata_byattr.Close

              AAPL   DELL    GOOG   MSFT
Date
2010-01-04   30.57  14.54  313.06  30.95
2010-01-05   30.63  14.87  311.68  30.96
2010-01-06   30.14  14.58  303.83  30.77
2010-01-07   30.08  14.72  296.75  30.45
2010-01-08   30.28  14.85  300.71  30.66
2010-01-11   30.02  14.86  300.25  30.27
2010-01-12   29.67  15.06  294.94  30.07
2010-01-13   30.09  15.07  293.25  30.35
2010-01-14   29.92  14.70  294.63  30.96
2010-01-15   29.42  14.40  289.71  30.86
2010-01-19   30.72  14.81  293.52  31.10
2010-01-20   30.25  14.51  289.91  30.58
2010-01-21   29.72  14.39  291.20  30.01
2010-01-22   28.25  13.64  274.73  28.96
2010-01-25   29.01  13.89  269.73  29.32
2010-01-26   29.42  13.58  270.94  29.50
2010-01-27   29.70  13.53  270.78  29.67
2010-01-28   28.47  13.28  266.88  29.16
2010-01-29   27.44  12.90  264.71  28.18
2010-02-01   27.82  13.22  266.24  28.41
2010-02-02   27.98  13.30  265.29  28.46
2010-02-03   28.46  13.36  270.14  28.63
2010-02-04   27.44  13.01  263.13  27.84
2010-02-05   27.92  13.24  265.38  28.02
2010-02-08   27.73  13.39  266.47  27.72
2010-02-09   28.03  13.55  267.95  28.01
2010-02-10   27.87  13.75  266.96  27.99
2010-02-11   28.38  13.95  267.93  28.12
2010-02-12   28.63  13.84  266.29  27.93
2010-02-16   29.06  14.14  270.38  28.35
...            ...    ...     ...    ...
2017-05-22  153.99    NaN  941.86  68.45
2017-05-23  153.80    NaN  948.82  68.68
2017-05-24  153.34    NaN  954.96  68.77
2017-05-25  153.87    NaN  969.54  69.62
2017-05-26  153.61    NaN  971.47  69.96
2017-05-30  153.67    NaN  975.88  70.41
2017-05-31  152.76    NaN  964.86  69.84
2017-06-01  153.18    NaN  966.95  70.10
2017-06-02  155.45    NaN  975.60  71.76
2017-06-05  153.93    NaN  983.68  72.28
2017-06-06  154.45    NaN  976.57  72.52
2017-06-07  155.37    NaN  981.08  72.39
2017-06-08  154.99    NaN  983.41  71.95
2017-06-09  148.98    NaN  949.83  70.32
2017-06-12  145.42    NaN  942.90  69.78
2017-06-13  146.59    NaN  953.40  70.65
2017-06-14  145.16    NaN  950.76  70.27
2017-06-15  144.29    NaN  942.31  69.90
2017-06-16  142.27    NaN  939.78  70.00
2017-06-19  146.34    NaN  957.37  70.87
2017-06-20  145.01    NaN  950.63  69.91
2017-06-21  145.87    NaN  959.45  70.27
2017-06-22  145.63    NaN  957.09  70.26
2017-06-23  146.28    NaN  965.59  71.21
2017-06-26  145.82    NaN  952.27  70.53
2017-06-27  143.73    NaN  927.33  69.21
2017-06-28  145.83    NaN  940.49  69.80
2017-06-29  143.68    NaN  917.79  68.49
2017-06-30  144.02    NaN  908.73  68.93
2017-07-03  143.50    NaN  898.70  68.17

[1887 rows x 4 columns]

In [347]:
pdata.loc[:,'6/1/2012',:] #indexing by loc , iloc

                AAPL         DELL    GOOG         MSFT
Open    8.131000e+01        12.15  285.61        28.76
High    8.181000e+01        12.30  286.04        28.96
Low     8.007000e+01        12.04  283.89        28.44
Close   8.014000e+01        12.07  285.20        28.45
Volume  1.302451e+08  19397658.00     NaN  56641282.00

In [349]:
pdata_byattr.loc['Close', '5/22/2012':, :]

              AAPL   DELL    GOOG   MSFT
Date
2012-05-22   79.57  15.08  300.10  29.76
2012-05-23   81.51  12.49  304.43  29.11
2012-05-24   80.76  12.45  301.53  29.07
2012-05-25   80.33  12.46  295.47  29.06
2012-05-29   81.75  12.66  296.87  29.56
2012-05-30   82.74  12.56  293.82  29.34
2012-05-31   82.53  12.33  290.14  29.19
2012-06-01   80.14  12.07  285.20  28.45
2012-06-04   80.61  12.00  289.01  28.55
2012-06-05   80.40  12.16  284.92  28.50
2012-06-06   81.64  12.22  289.99  29.35
2012-06-07   81.67  12.13  288.83  29.23
2012-06-08   82.90  12.12  289.93  29.65
2012-06-11   81.60  11.86  283.97  28.90
2012-06-12   82.31  11.97  282.27  29.29
2012-06-13   81.74  12.28  280.26  29.13
2012-06-14   81.65  12.34  279.25  29.34
2012-06-15   82.02  12.30  281.97  30.02
2012-06-18   83.68  12.42  285.14  29.84
2012-06-19   83.92  12.18  290.47  30.70
2012-06-20   83.68  12.30  288.47  30.93
2012-06-21   82.52  12.00  282.32  30.14
2012-06-22   83.16  12.20  285.45  30.70
2012-06-25   81.54  11.94  280.07  29.86
2012-06-26   81.72  11.92  282.06  30.02
2012-06-27   82.07  12.33  284.36  30.17
2012-06-28   81.29  11.95  281.87  29.91
2012-06-29   83.43  12.51  289.74  30.59
2012-07-02   84.65  12.38  289.94  30.56
2012-07-03   85.63  12.68  293.62  30.76
...            ...    ...     ...    ...
2017-05-22  153.99    NaN  941.86  68.45
2017-05-23  153.80    NaN  948.82  68.68
2017-05-24  153.34    NaN  954.96  68.77
2017-05-25  153.87    NaN  969.54  69.62
2017-05-26  153.61    NaN  971.47  69.96
2017-05-30  153.67    NaN  975.88  70.41
2017-05-31  152.76    NaN  964.86  69.84
2017-06-01  153.18    NaN  966.95  70.10
2017-06-02  155.45    NaN  975.60  71.76
2017-06-05  153.93    NaN  983.68  72.28
2017-06-06  154.45    NaN  976.57  72.52
2017-06-07  155.37    NaN  981.08  72.39
2017-06-08  154.99    NaN  983.41  71.95
2017-06-09  148.98    NaN  949.83  70.32
2017-06-12  145.42    NaN  942.90  69.78
2017-06-13  146.59    NaN  953.40  70.65
2017-06-14  145.16    NaN  950.76  70.27
2017-06-15  144.29    NaN  942.31  69.90
2017-06-16  142.27    NaN  939.78  70.00
2017-06-19  146.34    NaN  957.37  70.87
2017-06-20  145.01    NaN  950.63  69.91
2017-06-21  145.87    NaN  959.45  70.27
2017-06-22  145.63    NaN  957.09  70.26
2017-06-23  146.28    NaN  965.59  71.21
2017-06-26  145.82    NaN  952.27  70.53
2017-06-27  143.73    NaN  927.33  69.21
2017-06-28  145.83    NaN  940.49  69.80
2017-06-29  143.68    NaN  917.79  68.49
2017-06-30  144.02    NaN  908.73  68.93
2017-07-03  143.50    NaN  898.70  68.17

[1287 rows x 4 columns]

In [351]:
stacked = pdata.loc[:, '5/30/2012':, :].to_frame()
stacked

                   AAPL   DELL    GOOG   MSFT
Date       minor
2012-05-30 Open   81.31  12.59  293.79  29.35
           High   82.86  12.70  295.65  29.48
           Low    80.94  12.46  291.47  29.12
           Close  82.74  12.56  293.82  29.34
2012-05-31 Open   82.96  12.53  294.07  29.30
           High   83.07  12.54  294.70  29.42
           Low    81.64  12.33  289.21  28.94
           Close  82.53  12.33  290.14  29.19
2012-06-01 Open   81.31  12.15  285.61  28.76
           High   81.81  12.30  286.04  28.96
           Low    80.07  12.04  283.89  28.44
           Close  80.14  12.07  285.20  28.45
2012-06-04 Open   80.21  12.11  284.82  28.62
           High   81.07  12.11  289.95  28.78
           Low    78.36  11.80  284.72  28.32
           Close  80.61  12.00  289.01  28.55
2012-06-05 Open   80.18  11.95  287.44  28.51
           High   80.92  12.24  288.78  28.75
           Low    79.76  11.95  282.95  28.39
           Close  80.40  12.16  284.92  28.50
2012-06-06 Open   81.11  12.20  287.95  28.88
           High   81.98  12.28  290.69  29.37
           Low    80.79  12.09  286.52  28.81
           Close  81.64  12.22  289.99  29.35
2012-06-07 Open   82.47  12.32  293.51  29.64
           High   82.47  12.41  293.65  29.70
           Low    81.50  12.12  288.34  29.17
           Close  81.67  12.13  288.83  29.23
2012-06-08 Open   81.66  12.13  287.64  29.21
           High   82.94  12.22  290.21  29.68
...                 ...    ...     ...    ...
2013-10-18 Low    72.24  13.83  486.51  34.33
           Close  72.70  13.83  505.20  34.96
2013-10-21 Open   73.11  13.85  505.22  34.98
           High   74.90  13.86  508.99  35.20
           Low    73.07  13.84  499.28  34.91
           Close  74.48  13.85  501.15  34.99
2013-10-22 Open   75.20  13.85  502.00  35.02
           High   75.49  13.85  505.99  35.10
           Low    72.58  13.84  497.40  34.52
           Close  74.27  13.84  503.00  34.58
2013-10-23 Open   74.14  13.85  500.00  34.35
           High   75.10  13.85  516.86  34.49
           Low    74.14  13.84  499.81  33.67
           Close  74.99  13.84  515.19  33.76
2013-10-24 Open   75.00  13.85  515.42  33.82
           High   76.07  13.85  519.76  34.10
           Low    74.64  13.84  511.89  33.57
           Close  75.99  13.85  512.26  33.72
2013-10-25 Open   75.90  13.84  513.90  35.88
           High   76.18  13.85  513.90  36.29
           Low    75.02  13.84  504.86  35.47
           Close  75.14  13.84  507.09  35.73
2013-10-28 Open   75.58  13.84  507.09  35.61
           High   75.86  13.85  511.20  35.73
           Low    74.74  13.82  505.99  35.27
           Close  75.70  13.83  506.99  35.57
2013-10-29 Open   76.61  13.84  509.04  35.63
           High   77.04  13.87  517.95  35.72
           Low    73.51  13.83  506.24  35.26
           Close  73.81  13.86  517.60  35.52

[1428 rows x 4 columns]

In [352]:
stacked = pdata_byattr.loc[:, '5/30/2012':, :].to_frame()
stacked # table come into rows, and outmost indexes com into columns

                    Open    High     Low   Close       Volume
Date       minor
2012-05-30 AAPL    81.31   82.86   80.94   82.74  132355209.0
           DELL    12.59   12.70   12.46   12.56   19787882.0
           MSFT    29.35   29.48   29.12   29.34   41590049.0
2012-05-31 AAPL    82.96   83.07   81.64   82.53  122977603.0
           DELL    12.53   12.54   12.33   12.33   19955689.0
           MSFT    29.30   29.42   28.94   29.19   39142318.0
2012-06-01 AAPL    81.31   81.81   80.07   80.14  130245094.0
           DELL    12.15   12.30   12.04   12.07   19397658.0
           MSFT    28.76   28.96   28.44   28.45   56641282.0
2012-06-04 AAPL    80.21   81.07   78.36   80.61  139247129.0
           DELL    12.11   12.11   11.80   12.00   17015779.0
           MSFT    28.62   28.78   28.32   28.55   47928161.0
2012-06-05 AAPL    80.18   80.92   79.76   80.40   97053376.0
           DELL    11.95   12.24   11.95   12.16   15620917.0
           MSFT    28.51   28.75   28.39   28.50   45715327.0
2012-06-06 AAPL    81.11   81.98   80.79   81.64  100362262.0
           DELL    12.20   12.28   12.09   12.22   20779977.0
           MSFT    28.88   29.37   28.81   29.35   46860486.0
2012-06-07 AAPL    82.47   82.47   81.50   81.67   94993164.0
           DELL    12.32   12.41   12.12   12.13   20074035.0
           MSFT    29.64   29.70   29.17   29.23   37794901.0
2012-06-08 AAPL    81.66   82.94   81.29   82.90   86872870.0
           DELL    12.13   12.22   12.02   12.12   18155683.0
           MSFT    29.21   29.68   29.05   29.65   42554321.0
2012-06-11 AAPL    83.96   84.07   81.52   81.60  147815696.0
           DELL    12.15   12.20   11.82   11.86   16931978.0
           MSFT    29.73   29.81   28.82   28.90   46365066.0
2012-06-12 AAPL    82.07   82.37   80.96   82.31  108894961.0
           DELL    11.91   12.01   11.68   11.97   17608166.0
           MSFT    29.10   29.30   28.84   29.29   35338135.0
...                  ...     ...     ...     ...          ...
2017-06-20 AAPL   146.87  146.87  144.94  145.01   24900073.0
           GOOG   957.52  961.62  950.01  950.63    1125990.0
           MSFT    70.82   70.87   69.87   69.91   21512231.0
2017-06-21 AAPL   145.52  146.07  144.61  145.87   21265751.0
           GOOG   953.64  960.10  950.76  959.45    1202233.0
           MSFT    70.21   70.62   69.94   70.27   19891051.0
2017-06-22 AAPL   145.77  146.70  145.12  145.63   19106294.0
           GOOG   958.70  960.72  954.55  957.09     941958.0
           MSFT    70.54   70.59   69.71   70.26   22965738.0
2017-06-23 AAPL   145.13  147.16  145.11  146.28   35439389.0
           GOOG   956.83  966.00  954.20  965.59    1527856.0
           MSFT    70.09   71.25   69.92   71.21   27617291.0
2017-06-26 AAPL   147.17  148.28  145.38  145.82   25692361.0
           GOOG   969.90  973.31  950.79  952.27    1598355.0
           MSFT    71.40   71.71   70.44   70.53   19606974.0
2017-06-27 AAPL   145.01  146.16  143.62  143.73   24761891.0
           GOOG   942.46  948.29  926.85  927.33    2579930.0
           MSFT    70.11   70.18   69.18   69.21   25215128.0
2017-06-28 AAPL   144.49  146.11  143.16  145.83   22082432.0
           GOOG   929.00  942.75  916.00  940.49    2721406.0
           MSFT    69.21   69.84   68.79   69.80   25806200.0
2017-06-29 AAPL   144.71  145.13  142.28  143.68   31499368.0
           GOOG   929.92  931.26  910.62  917.79    3299176.0
           MSFT    69.38   69.49   68.09   68.49   28918715.0
2017-06-30 AAPL   144.45  144.96  143.78  144.02   23024107.0
           GOOG   926.05  926.05  908.31  908.73    2090226.0
           MSFT    68.78   69.38   68.74   68.93   24161068.0
2017-07-03 AAPL   144.88  145.30  143.10  143.50   14277848.0
           GOOG   912.18  913.94  894.79  898.70    1710373.0
           MSFT    69.33   69.60   68.02   68.17   16165538.0

[3745 rows x 5 columns]

In [354]:
stacked.to_panel()

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1282 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2017-07-03 00:00:00
Minor_axis axis: AAPL to MSFT